constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (fluid_light fluid_heavy);

fluid_light
{
    transportModel  Newtonian;
    nu              3.13e-09;
    rho             1;
}

fluid_heavy
{
    transportModel  Newtonian;
    nu              3.13e-09;
    rho             2;
}

sigma           0.01;


// ************************************************************************* //
