system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.fluid_light.*"
        {
        nAlphaCorr 3;
        nAlphaSubCycles 3;
        cAlpha 1;

        MULESCorr yes;
        nLimiterIter 25;

        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-10;
        relTol 0;
        }

    "pcorr.*"
        {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-7;
        relTol 0;
        }

    p_rgh
        {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-7;
        relTol 0.0;
        }

    p_rghFinal
        {
        $p_rgh;
        relTol 0;
        }

    "U"
        {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-08;
        relTol 0;
        }

    "UFinal"
        {
        $U;
        }
    }

PIMPLE
    {
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors 3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    }

relaxationFactors
{
/*
fields
{
p 0.3;
pFinal 1;
}
equations
{
"U" 0.7;
"UFinal" 1;
}
*/
}

// ************************************************************************* //
